cases/squareChannelConv_robin_constantFlux/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 293;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    heater
    {
        type            mixed;

        // reference value: surrounding temperature
        refValue        uniform 300;

        // reference gradient = q/k_turb = 1200 [W/m2] / 0.9[W/m/K]
        refGradient     uniform 1333;

        // Aproximación utilizando conductividad
        // térmica turbulenta igual a 0.9 W/mK
        // f = 1/(1+k_turb/delta/h), delta: face-center to cell-center distance
        valueFraction   uniform 0.01369;
    }
    top
    {
        type            zeroGradient;
    }
    front
    {
        type            zeroGradient;
    }
    back
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
